app/Controllers/Catalog.php

SELECT *
FROM `books`
WHERE `title` LIKE '%de %' ESCAPE '!'
ORDER BY `id` ASC
 LIMIT 24, 12
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `title` LIKE '%staten%' ESCAPE '!'
---
    public function index()
    {
        $bookModel = new BookModel();

        $perPage = 12; // jumlah buku per halaman
        $keyword = $this->request->getGet('q');

        // mulai dari builder dasar
        $builder = $bookModel;

        // kalau ada keyword, tambahkan filter
        if ($keyword) {
            $builder = $builder->like('title', $keyword);
        }

        // PENTING: pakai paginate, bukan findAll()
        $books = $builder
            ->orderBy('id', 'ASC')
            ->paginate($perPage, 'books');

SELECT *
FROM `books`
WHERE `books`.`id` = '563'
---
    public function viewer($id)
    {
        $bookModel = new \App\Models\BookModel();
        $book = $bookModel->find($id);